Tekla Open API Reference for Tekla Structures 2025
InputItem.GetInputType Method
 Returns the type of the input item.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public InputItem.InputTypeEnum GetInputType()
Public Function GetInputType As InputItem.InputTypeEnum
Return Value
Type: InputItem.InputTypeEnum
The type of the input item.
See Also
Reference
InputItem Class
Tekla.Structures.Model Namespace